app/Controllers/AlunosController.php

    public function novo()
    {
        //
        $encarregadosModel = new EncarregadosModel();

        $data = [
            'pageTitle' => 'Cadastrando aluno',
            'encarregados' => $encarregadosModel->select('id, nome')->findAll()
        ];
---
SELECT `id`, `nome`
FROM `encarregados`

    public function listar(){

        $model = model('AlunosModel');

        //Using Join

        $model->select('alunos.id as id, alunos.nome as nome, alunos.classe as classe, alunos.turno as turno, alunos.telefone as telefone, alunos.sala as sala, e.nome as encarregado');

        $model->join('encarregados as e', 'alunos.encarregado_id = e.id', 'left');

        //End join

        $data = ['title' => 'Lista de alunos', 'datas' => $model->paginate(10), 'pager' => $model->pager];
---
SELECT COUNT(*) AS `numrows`
FROM `alunos`
JOIN `encarregados` as `e` ON `alunos`.`encarregado_id` = `e`.`id`
SELECT `alunos`.`id` as `id`, `alunos`.`nome` as `nome`, `alunos`.`classe` as `classe`, `alunos`.`turno` as `turno`, `alunos`.`telefone` as `telefone`, `alunos`.`sala` as `sala`, `e`.`nome` as `encarregado`
FROM `alunos`
JOIN `encarregados` as `e` ON `alunos`.`encarregado_id` = `e`.`id`
 LIMIT 10

        $post = $this->validator->getValidated();
        $model = model('AlunosModel');

        $model->insert([
            'nome' => $post['nome'],
            'data_nascimento' => $post['data_nascimento'],
            'classe' => $post['classe'],
            'turno' => $post['turno'],
            'sala' => $post['sala'],
            'curso' => $post['curso'],
            'localizacao' => $post['localizacao'],
            'telefone' => $post['telefone'],
            'encarregado_id' => $post['encarregado'],
            'obs' => $post['obs'],
            ]
        );
---
INSERT INTO `alunos` (`nome`, `data_nascimento`, `classe`, `turno`, `sala`, `curso`, `localizacao`, `telefone`, `encarregado_id`, `obs`) VALUES ('Wilson Lucas', '2024-03-08', '11ª classe', 'Manhã', '13', 'C.F.B', 'Morro Bento', '921345647', '4', 'oiiuuyyyyyyyyyyyyyyy')

    private function getStudants_Parents(){

        $db = db_connect();

        $builder = $db->table('alunos as a');

        $builder->select('a.id as id, a.nome as nome, a.classe as classe, a.turno as turno, a.telefone as telefone, a.sala as sala, e.nome as encarregado');

        $builder->join('encarregados as e', 'a.encarregado_id = e.id', 'left');

        $result = $builder->get()->getResultObject();
---
SELECT `a`.`id` as `id`, `a`.`nome` as `nome`, `a`.`classe` as `classe`, `a`.`turno` as `turno`, `a`.`telefone` as `telefone`, `a`.`sala` as `sala`, `e`.`nome` as `encarregado`
FROM `alunos` as `a`
JOIN `encarregados` as `e` ON `a`.`encarregado_id` = `e`.`id`