app/Controllers/EncarregadosController.php

    public function delete($id){

        $model = new EncarregadosModel();

        try {

            $model->delete($id);
---
DELETE FROM `encarregados`
WHERE `id` IN ('5')

    public function editar($id){

        $model = new EncarregadosModel();

        $data = [
            'data' => $model->find($id),
            'pageTitle' => 'Editando dados do encarregado'
        ];
---
SELECT *
FROM `encarregados`
WHERE `encarregados`.`id` = '6'

    public function listar(){

        $model = new EncarregadosModel();

        $data = [
            'title' => 'Lista dos encarregados',
            'datas' => $model->paginate(10),
---
SELECT *
FROM `encarregados`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `encarregados`