app/Controllers/NotasController.php

SELECT *
FROM `disciplinas`
SELECT `id`, `nome`
FROM `alunos`
---
    public function index()
    {
        //
        $time = new Time();
        $ano_passado = new Time('-1 year');

        $disciplinasModel = new DisciplinasModel();
        $alunosModel = new AlunosModel();

        $data = [
            'pageTitle' => "Cadastro de notas",
            'ano_actual' => $time->getYear(),
            'ano_passado' => $ano_passado->getYear(),
            'disciplinas' => $disciplinasModel->findAll(),
            'alunos'      => $alunosModel->select('id, nome')->findAll()

INSERT INTO `notas` (`aluno_id`, `disciplina_id`, `trimestre`, `ano_lectivo`, `mac`, `npp`, `npt`, `mt`) VALUES ('20', '1', 'Iº Trimeste', '2023/2024', '10', '11', '12', '11')
---

        $validaDatas = $this->validator->getValidated();

        $notasModel->insert($validaDatas);