app/Controllers/ProfessoresController.php

SELECT `id`, `nome`
FROM `users`
---
    public function index()
    {
        //
        $usuariosModel = new UserModel();
        $data = [
            'pageTitle' => 'Cadastrando professor',
            'usuarios' => $usuariosModel->select('id, nome')->findAll()

SELECT *
FROM `professores`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `professores`
---
    public function listar(){

        $model = new ProfessoresModel();

        $data = [
            'pageTitle' => 'Lista dos professores',
            'datas' => $model->paginate(10),

INSERT INTO `professores` (`nome`, `data_nascimento`, `nivel_academico`, `localizacao`, `telefone`, `obs`, `user_id`) VALUES ('Augusto Ribeiro', '2024-03-12', 'Frequência universitária', 'Floresta', '921345648', 'Estudante trabalhador', '8')
---
        $post = $this->validator->getValidated();
        $model = new ProfessoresModel();

        $model->insert([
            'nome' => $post['nome'],
            'data_nascimento' => $post['data_nascimento'],
            'nivel_academico' => $post['nivel'],
            'localizacao' => $post['localizacao'],
            'telefone' => $post['telefone'],
            'obs' => $post['obs'],
            'user_id' => $post['usuario'],
        ]);