app/Controllers/UserController.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function listar(){

        $model = new UserModel();

        $data = [
            'pageTitle' => 'Lista de usuários',
            'datas' => $model->paginate(10),