app/Controllers/UserController.php

    public function loginStore()
    {
        helper('form');
        $validated = $this->validate(
            [
                'email' => 'required|valid_email',
                'senha' => 'required',
            ],
            [
                'email'=> [
                    'required' => 'O email é obrigatório!',
                    'valid_email' => 'digite um email válido!',
                ],
                'senha'=> [
                    'required' => 'A senha é obrigatória!'
                ]
            ]
            );

        if(!$validated){
            return redirect()->route('login')->with('erros', $this->validator->getErrors());
        }

        $user = new UserModel();
       // $inserted = $user->insert($this->request->getPost());
       $email = $this->request->getPost('email');
       $senha = $this->request->getPost('senha');

       $userFound = $user->select('nome, email, senha')->where(['email' => $email, 'senha'=> $senha])->first();
---
SELECT `nome`, `email`, `senha`
FROM `users`
WHERE `email` = 'wilsonvicentelucas@gmail.com'
AND `senha` = 'Wilson'
 LIMIT 1